Revit 2027 API
GroupTypeId.RouteAnalysis Property
 Route Analysis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RouteAnalysis { get; }
Public Shared ReadOnly Property RouteAnalysis As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RouteAnalysis {
	ForgeTypeId^ get ();
}
static member RouteAnalysis : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace